** Project examples

#+NAME: 4b0a6155-0dec-4cab-8c60-6f0243e93897
#+begin_src ein-python
  import tensorflow as tf
  print(tf.__version__)
#+end_src

#+RESULTS: 4b0a6155-0dec-4cab-8c60-6f0243e93897
:
: 1.9.0

#+NAME: ec40f601-d749-426d-9e1e-1c7d26eaa2e3
#+begin_src ein-python
  print(tf.test.is_built_with_cuda())
#+end_src

#+RESULTS: ec40f601-d749-426d-9e1e-1c7d26eaa2e3
: False

#+NAME: 85b275b6-384f-4dec-a29c-c1bf471d6666
#+begin_src ein-python
  print(tf.config.list_physical_devices('GPU'))
#+end_src

#+RESULTS: 85b275b6-384f-4dec-a29c-c1bf471d6666
: ---------------------------------------------------------------------------
: AttributeError                            Traceback (most recent call last)
: Input In [5], in <cell line: 1>()
: ----> 1 print(tf.config.list_physical_devices('GPU'))
:
: AttributeError: module 'tensorflow' has no attribute 'config'

** Server test code

First, remember to set this when running notebook server under =guix=

#+begin_src emacs-lisp
  (setq ein:url-localhost "")
#+end_src

#+RESULTS:

Then, test the server with [[file:~/Nextcloud_cnrs/CsbWiki/ein.org::*Python][this]] code.

It might happen that =ein= doesnt know how to connnect to the server. In this case, run this before
the previous

#+NAME: 36deef35-7ac0-4111-9a60-fd56b89b71b7
#+begin_src ein-python
  print("Test takes %s" % 8)
#+end_src

#+RESULTS: 36deef35-7ac0-4111-9a60-fd56b89b71b7
: Test takes 8


